# Create Method (Document, String, DXFExportOptions) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDWGSettings..::..Create Method (Document, String, DXFExportOptions)
ExportDWGSettings Class See Also
---
Create a DWG export settings with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static ExportDWGSettings Create(
	Document document,
	string name,
	DXFExportOptions options
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	name As String, _
	options As DXFExportOptions _
) As ExportDWGSettings
```

Visual C++
---
```text
public:
static ExportDWGSettings^ Create(
	Document^ document,
	String^ name,
	DXFExportOptions^ options
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document where created settings is saved.
name
    Type: System..::..String The name specified to this settings.
options
    Type: Autodesk.Revit.DB..::..DXFExportOptions Initialize settings by using values in DXFExportOptions.
# ### Return Value
The new DWG export settings instance.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | ExistOrEmpty |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportDWGSettings Class
Create Overload
Autodesk.Revit.DB Namespace